app/views/tweets/show.html.erb


      <% if Like.find_by(user_id: @current_user.id, tweet_id: @tweet.id) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."tweet_id" = ? LIMIT ?  [["user_id", 3], ["tweet_id", 7], ["LIMIT", 1]]