app/views/users/likes.html.erb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    <% @likes.each do |like| %>
      <% tweet = Tweet.find_by(id: like.tweet_id) %>