app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "tweet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["tweet_id", 7], ["created_at", "2020-04-16 16:58:59.675863"], ["updated_at", "2020-04-16 16:58:59.675863"]]
---
  def create
  	@like = Like.new(
      user_id: @current_user.id,
      tweet_id: params[:tweet_id]
      )
    @like.save