app/controllers/tweets_controller.rb

  def index
  	@tweets = Tweet.all.order(created_at: :desc)
---
SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC

  def show
  	@tweet = Tweet.find_by(id: params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def edit
  	@tweet = Tweet.find_by(id: params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
  	@tweet = Tweet.new(
      body: params[:body],
      user_id: @current_user.id
      )
    if @tweet.save
---
INSERT INTO "tweets" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "a"], ["user_id", 3], ["created_at", "2020-04-15 20:01:27.751481"], ["updated_at", "2020-04-15 20:01:27.751481"]]

  def update
  	@tweet = Tweet.find_by(id: params[:id])
    @tweet.body = params[:body]
    if @tweet.save
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "tweets" SET "body" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["body", "3時のおやつの時間だー！!"], ["updated_at", "2020-04-15 07:20:37.600009"], ["id", 5]]

  def destroy
  	@tweet = Tweet.find_by(id: params[:id])
    @tweet.destroy
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 8]]