app/controllers/users_controller.rb

  def login
    @user = User.find_by(
      email: params[:email],
      password: params[:password]
      )
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "a"], ["password", "a"], ["LIMIT", 1]]