app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "icon_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "あつき"], ["email", "3flower.atu87@gmail.com"], ["icon_id", "3.jpg"], ["updated_at", "2020-04-15 18:32:39.752550"], ["id", 3]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    # 画像を更新する時は画像名をuser.idに変更してpublic/user_imeagesに保存する
    if params[:image]
      image = params[:image]
      @user.icon_id = "#{@user.id}.jpg"
      File.binwrite("public/user_images/#{@user.icon_id}",image.read)
    end

    if @user.save

INSERT INTO "users" ("name", "email", "icon_id", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "a"], ["email", "a"], ["icon_id", "no_image.jpg"], ["password", "a"], ["created_at", "2020-04-15 18:23:55.465915"], ["updated_at", "2020-04-15 18:23:55.465915"]]
---
  def create
  	@user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      icon_id: "no_image.jpg"
      )
  	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "hojokaban@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 3]]
---
  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)